In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('./bert/glue_data/AuthorClass/train.csv')

In [5]:
#df2 = df.sample(frac=0.1)

In [6]:
#df2.to_csv('train_2.csv', index=False)

In [7]:
#df2[['text', 'author']]

In [4]:
sorted(df['author'].value_counts()[0:20].index.values)

[4, 8, 9, 14, 15, 18, 19, 21, 25, 26, 30, 33, 37, 38, 39, 42, 43, 45, 48, 50]

In [9]:
df.shape

(53678, 2)

In [ ]:
df['author'].value_counts()

In [7]:
val = df['author'].value_counts()[20:].index.values

In [8]:
val

array([ 1, 41, 28, 10, 32, 36, 17, 35, 29, 12, 46, 20, 22, 13, 44, 23, 34,
       40,  6, 11,  2, 24, 27,  3, 16])

In [9]:
mask = df['author'].isin([1, 41, 28, 10, 32, 36, 17, 35, 29, 12, 46, 20, 22, 13, 44, 23, 34,
       40,  6, 11,  2, 24, 27,  3, 16])

In [10]:
df[mask]['author'].value_counts()

1     912
41    911
28    823
10    755
32    703
36    693
17    660
35    659
29    645
12    627
46    605
20    587
22    495
13    485
44    468
23    455
34    453
40    430
6     407
11    383
2     382
24    380
27    306
3     213
16    183
Name: author, dtype: int64

In [11]:
def separate(group):
    sample = group.sample(105)
    return sample

def separate_train(group):
    sample = group[100:]
    return sample

def separate_test(group):
    sample = group[0:100]
    return sample

In [12]:
df[mask].head()

                                                text  author
0  ou have time to listen i will give you the ent...       1
1  wish for solitude he was twenty years of age a...       1
2  and the skirt blew in perfect freedom about th...       1
3  of san and the rows of shops opposite impresse...       1
4  an hour s walk was as tiresome as three in a s...       1

In [13]:
separated_df = df[mask].groupby('author').apply(separate)

In [14]:
separated_df['author'].value_counts()

41    105
36    105
6     105
10    105
12    105
16    105
20    105
22    105
24    105
28    105
32    105
34    105
40    105
35    105
44    105
46    105
1     105
3     105
11    105
13    105
17    105
23    105
27    105
29    105
2     105
Name: author, dtype: int64

In [15]:
separated_df

                                                           text  author
author
1      296    afraid not here is you can return it when conv...       1
       0      ou have time to listen i will give you the ent...       1
       225    the city without walking wrote the address car...       1
       206    of her error he was glad to have a minute in w...       1
       582    think she never looked better i am growing ver...       1
...                                                         ...     ...
46     50628  as a the ease with which she could turn her fa...      46
       50474  if you shall the colonel the king of england s...      46
       50624  that at a word he should lose his agent and he...      46
       50363  he ain got de to meek her know he in virginia ...      46
       50401  george â george washington â you mean george w...      46

[2625 rows x 2 columns]

In [16]:
separated_df.reset_index(drop=True)

                                                   text  author
0     afraid not here is you can return it when conv...       1
1     ou have time to listen i will give you the ent...       1
2     the city without walking wrote the address car...       1
3     of her error he was glad to have a minute in w...       1
4     think she never looked better i am growing ver...       1
...                                                 ...     ...
2620  as a the ease with which she could turn her fa...      46
2621  if you shall the colonel the king of england s...      46
2622  that at a word he should lose his agent and he...      46
2623  he ain got de to meek her know he in virginia ...      46
2624  george â george washington â you mean george w...      46

[2625 rows x 2 columns]

In [17]:
train_df = separated_df.reset_index(drop=True).groupby('author').apply(separate_train)

In [18]:
test_df = separated_df.reset_index(drop=True).groupby('author').apply(separate_test)

In [19]:
train_df.reset_index(drop=True).to_csv('few_shot_train.csv', index=False)
test_df.reset_index(drop=True).to_csv('few_shot_test.csv',index=False)